Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
#if defined(MEAS_PREEMPTION_TIME)
void StartPreemptionTimeTaskA(void const * argument);
void StartPreemptionTimeTaskB(void const * argument);
void StartPreemptionTimeTaskC(void const * argument);
#endif // defined(MEAS_PREEMPTION_TIME)

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
void StartInterruptLatencyTimeTask(void const * argument);
#endif // defined(MEAS_INTERRUPT_LATENCY_TIME)

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
void StartSemaphoreShufflingTimeTaskA(void const * argument);
void StartSemaphoreShufflingTimeTaskB(void const * argument);
#endif // defined(MEAS_SEMAPHORE_SHUFFLING_TIME)

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
void StartDeadlockBreakingTimeTaskA(void const * argument);
void StartDeadlockBreakingTimeTaskB(void const * argument);
void StartDeadlockBreakingTimeTaskC(void const * argument);
#endif // defined(MEAS_DEADLOCK_BREAKING_TIME)

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
void StartDatagramThroughputTimeTaskA(void const * argument);
void StartDatagramThroughputTimeTaskB(void const * argument);
#endif // defined(MEAS_DATAGRAM_THROUGHPUT_TIME)

#if defined(BLINKING_LED)
void StartForwardLEDTask(void const * argument);
void StartReverseLEDTask(void const * argument);
#endif // defined(BLINKING_LED)

#if defined(MEAS_W_LOAD)
void StartSwitchChangedTask(void const * argument);

void StartTempMeasureTask(void const * argument);
void StartPotmeterMeasureTask(void const * argument);

void StartBLETask(void const * argument);

void StartUART6Task(void const * argument);
void StartUART6SendTask(void const * argument);

void StartSDCardTask(void const * argument);
#endif // defined(MEAS_W_LOAD)
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
#if defined(MEAS_W_LOAD)
  MX_ADC1_Init();
  MX_SDIO_SD_Init();
  MX_USART6_UART_Init();
  MX_ADC2_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
#endif // defined(MEAS_W_LOAD)

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
#if defined(MEAS_DEADLOCK_BREAKING_TIME)
  osMutexDef(DEADLOCKMUT);
  deadlockBreaking_xMutex = osMutexCreate(osMutex(DEADLOCKMUT));
#endif // defined(MEAS_DEADLOCK_BREAKING_TIME)
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
#if defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME) || \
	defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
  osSemaphoreDef(MEASSEMA);
  osSemaphoreDef(MEASSEMB);
  osSemaphoreDef(MEASSEMC);
  measureSemaphoreA_xSemaphore = osSemaphoreCreate(osSemaphore(MEASSEMA), 1);
  measureSemaphoreB_xSemaphore = osSemaphoreCreate(osSemaphore(MEASSEMB), 1);
  measureSemaphoreC_xSemaphore = osSemaphoreCreate(osSemaphore(MEASSEMC), 1);
  osSemaphoreWait(measureSemaphoreA_xSemaphore, 0);
  osSemaphoreWait(measureSemaphoreB_xSemaphore, 0);
  osSemaphoreWait(measureSemaphoreC_xSemaphore, 0);
#endif // defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME)
//|| defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  ThreadDef(STARTMEASURETASKID, StartStartMeasureTask, osPriorityNormal, 0, 128);
  startMeasureTaskHandle = osThreadCreate(Thread(STARTMEASURETASKID), NULL);

#if defined(MEAS_TASK_SWITCHING_TIME)
  ThreadDef(SWITCHINGTIMETASKAID, StartSwitchingTimeTaskA, osPriorityNormal, 0, 128);
  ThreadDef(SWITCHINGTIMETASKBID, StartSwitchingTimeTaskB, osPriorityNormal, 0, 128);
  ThreadDef(SWITCHINGTIMETASKCID, StartSwitchingTimeTaskC, osPriorityNormal, 0, 128);
  switchingTimeTaskAHandle = osThreadCreate(Thread(SWITCHINGTIMETASKAID), NULL);
  switchingTimeTaskBHandle = osThreadCreate(Thread(SWITCHINGTIMETASKBID), NULL);
  switchingTimeTaskCHandle = osThreadCreate(Thread(SWITCHINGTIMETASKCID), NULL);
#endif // defined(MEAS_TASK_SWITCHING_TIME)

#if defined(MEAS_PREEMPTION_TIME)
  ThreadDef(PREEMPTIONTIMETASKAID, StartPreemptionTimeTaskA, osPriorityNormal, 0, 128);
  ThreadDef(PREEMPTIONTIMETASKBID, StartPreemptionTimeTaskB, osPriorityAboveNormal, 0, 128);
  ThreadDef(PREEMPTIONTIMETASKCID, StartPreemptionTimeTaskC, osPriorityRealtime, 0, 128);
  preemptionTimeTaskAHandle = osThreadCreate(Thread(PREEMPTIONTIMETASKAID), NULL);
  preemptionTimeTaskBHandle = osThreadCreate(Thread(PREEMPTIONTIMETASKBID), NULL);
  preemptionTimeTaskCHandle = osThreadCreate(Thread(PREEMPTIONTIMETASKCID), NULL);
#endif // defined(MEAS_PREEMPTION_TIME)

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
  ThreadDef(INTERRUPTLATENCYTIMETASKID, StartInterruptLatencyTimeTask, osPriorityRealtime, 0, 128);
  interruptLatencyTimeTaskHandle = osThreadCreate(Thread(INTERRUPTLATENCYTIMETASKID), NULL);
#endif // defined(MEAS_INTERRUPT_LATENCY_TIME)

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
  ThreadDef(SEMAPHORESHUFFLINGTIMETASKAID, StartSemaphoreShufflingTimeTaskA, osPriorityNormal, 0, 128);
  ThreadDef(SEMAPHORESHUFFLINGTIMETASKBID, StartSemaphoreShufflingTimeTaskB, osPriorityAboveNormal, 0, 128);
  semaphoreShufflingTimeTaskAHandle = osThreadCreate(Thread(SEMAPHORESHUFFLINGTIMETASKAID), NULL);
  semaphoreShufflingTimeTaskBHandle = osThreadCreate(Thread(SEMAPHORESHUFFLINGTIMETASKBID), NULL);
#endif // defined(MEAS_SEMAPHORE_SHUFFLING_TIME)

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
  ThreadDef(DEADLOCKBREAKINGTIMETASKAID, StartDeadlockBreakingTimeTaskA, osPriorityNormal, 0, 128);
  ThreadDef(DEADLOCKBREAKINGTIMETASKBID, StartDeadlockBreakingTimeTaskB, osPriorityAboveNormal, 0, 128);
  ThreadDef(DEADLOCKBREAKINGTIMETASKCID, StartDeadlockBreakingTimeTaskC, osPriorityRealtime, 0, 128);
  deadlockBreakingTimeTaskAHandle = osThreadCreate(Thread(DEADLOCKBREAKINGTIMETASKAID), NULL);
  deadlockBreakingTimeTaskBHandle = osThreadCreate(Thread(DEADLOCKBREAKINGTIMETASKBID), NULL);
  deadlockBreakingTimeTaskCHandle = osThreadCreate(Thread(DEADLOCKBREAKINGTIMETASKCID), NULL);
#endif // defined(MEAS_DEADLOCK_BREAKING_TIME)

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
  ThreadDef(DATAGRAMTHROUGHPUTTIMETASKAID, StartDatagramThroughputTimeTaskA, osPriorityNormal, 0, 128);
  ThreadDef(DATAGRAMTHROUGHPUTTIMETASKBID, StartDatagramThroughputTimeTaskB, osPriorityNormal, 0, 128);
  datagramThroughputTimeTaskAHandle = osThreadCreate(Thread(DATAGRAMTHROUGHPUTTIMETASKAID), NULL);
  datagramThroughputTimeTaskBHandle = osThreadCreate(Thread(DATAGRAMTHROUGHPUTTIMETASKBID), NULL);
#endif // defined(MEAS_DATAGRAM_THROUGHPUT_TIME)

#if defined(BLINKING_LED)
  ThreadDef(FORWARDLEDTASKID, StartForwardLEDTask, osPriorityLow, 0, 128);
  ThreadDef(REVERSELEDTASKID, StartReverseLEDTask, osPriorityLow, 0, 128);
  forwardLEDTaskHandle = osThreadCreate(Thread(FORWARDLEDTASKID), NULL);
  reverseLEDTaskHandle = osThreadCreate(Thread(REVERSELEDTASKID), NULL);
#endif // defined(BLINKING_LED)

