Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
				memcpy(&message[9], value, 5);
			}

			if(uart6Send_xMessage!=NULL)
				for(i=0;i<MESSAGE_LENGTH;i++)
					osMessagePut(uart6Send_xMessage, message[i], 10);
			if(sdCardWrite_xMessage!=NULL)
				for(i=0;i<MESSAGE_LENGTH;i++)
				{
					osMessagePut(sdCardWrite_xMessage, message[i], 10);
				}
		}

		osDelay(1);
	}
}

void StartTempMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	uint8_t message[MESSAGE_LENGTH];
	uint8_t i;

	memcpy(message, "loctemp :", 9);

	while(1)
	{
		HAL_ADC_Start(&hadc1);
		if(HAL_ADC_PollForConversion(&hadc1, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc1);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}

		memcpy(&message[9], &adc_val, 4);
		message[13] = '\n';

		if(uart6Send_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
				osMessagePut(uart6Send_xMessage, message[i], 10);

		if(sdCardWrite_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(sdCardWrite_xMessage, message[i], 10);
			}

		osDelay(100);
	}
}

void StartPotmeterMeasureTask(void const * argument)
{
	uint32_t adc_val = 0;

	uint8_t message[MESSAGE_LENGTH];
	uint8_t i;

	memcpy(message, "potmeter:", 9);

	while(1)
	{
		HAL_ADC_Start(&hadc2);
		if(HAL_ADC_PollForConversion(&hadc2, portMAX_DELAY) == HAL_OK)
		{
			adc_val = HAL_ADC_GetValue(&hadc2);
		}
		else
		{
			adc_val = 0xFFFFFFFF;
		}

		memcpy(&message[9], &adc_val, 4);
		message[13] = '\n';

		if(uart6Send_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(uart6Send_xMessage, message[i], 10);
			}

		if(sdCardWrite_xMessage!=NULL)
			for(i=0;i<MESSAGE_LENGTH;i++)
			{
				osMessagePut(sdCardWrite_xMessage, message[i], 10);
			}

		osDelay(100);
	}
}

void StartBLETask(void const * argument)
{
	while(1)
	{
		// ToDo: Taszk implementálása.
		osDelay(1000);
	}
}

void StartUART6Task(void const * argument)
{
	const char connectString[] = "connect ";
	const char led0String[] = "led0    ";
	const char led1String[] = "led1    ";

	uint8_t data[MESSAGE_LENGTH];
	uint16_t size = sizeof(data)/sizeof(uint8_t);
	uint8_t entity[ENTITY_LENGTH+1];
	uint8_t value[VALUE_LENGTH];

	osSemaphoreDef(SEM);
	uart6_xSemaphore = osSemaphoreCreate(osSemaphore(SEM), 1);

	osSemaphoreWait(uart6_xSemaphore, 0);
	while(1)
	{
		HAL_UART_Receive_IT(&huart6, data, size);
		osDelay(1);
		if(osSemaphoreWait(uart6_xSemaphore, portMAX_DELAY) == osOK)
		{
			// ToDo: A bejövõ üzenetek feldolgozásának elvégzése.
			do
			{
				memcpy(entity, data, ENTITY_LENGTH);
				entity[ENTITY_LENGTH] = '\0';
				memcpy(value, &data[ENTITY_LENGTH+1], VALUE_LENGTH);

				if(!strcmp(entity, connectString))
				{
					RemoteControllerConnected();
				}
				else if(!strcmp(entity, led0String))
				{
					if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
						ChangeLed0State(GPIO_PIN_SET);
					else
						ChangeLed0State(GPIO_PIN_RESET);
				}
				else if(!strcmp(entity, led1String))
				{
					if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
						ChangeLed1State(GPIO_PIN_SET);
					else
						ChangeLed1State(GPIO_PIN_RESET);
				}
				else
				{
					// Valószínûleg bithiba történt, esetleg nem érkezett meg valamelyik byte, ekkor a további hibák\
					akkumulálódását elkerülvén kiürítjük a buffert.
					HAL_UART_Receive(&huart6, NULL, 128, 0);
				}
				// Sikeres fogadás esetén ha van még feldolgozásra váró üzenet, akkor azt dolgozzuk is fel!
			} while(HAL_UART_Receive(&huart6, data, size, 0) == HAL_OK);
		}
	}
	// ToDo: Valamiért kifagy a parancsfogadás!
}

void StartUART6SendTask(void const * argument)
{
	osMessageQDef(UART6MES, 140, uint8_t);
	uart6Send_xMessage = osMessageCreate(osMessageQ(UART6MES), NULL);

	osEvent event;
	uint8_t character;
	uint16_t size = sizeof(character)/sizeof(uint8_t);

	while(1)
	{
		event = osMessageGet(uart6Send_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			character = (uint32_t)event.value.p;

			// Az üzenetek küldése közben ne legyen megszakítás!
			portENTER_CRITICAL();
			HAL_UART_Transmit(&huart6, &character, size, 100);
			portEXIT_CRITICAL();
		}
	}
}

// FatFS open for append. Source: http://elm-chan.org/fsw/ff/res/app1.c
FRESULT open_append (
    FIL* fp,            /* [OUT] File object to create */
    const uint8_t* path    /* [IN]  File name to be opened */
)
{
    FRESULT fr;

    /* Opens an existing file. If not exist, creates a new file. */
    fr = f_open(fp, (char*)path, FA_WRITE | FA_OPEN_ALWAYS);

    if (fr == FR_OK) {
        /* Seek to end of the file to append data */
    	fr = f_lseek(fp, f_size(fp));
        if (fr != FR_OK)
            f_close(fp);
    }
    return fr;
}

void StartSDCardTask(void const * argument)
{
	// SDCard deinicializálásához szükséges külsõ változó
	extern Disk_drvTypeDef  disk;

	osMessageQDef(SDCARDMES, 255, uint8_t);
	sdCardWrite_xMessage = osMessageCreate(osMessageQ(SDCARDMES), NULL);

	FATFS fileSystem;
	FIL logFile;
	UINT testBytes;
	FRESULT res;

	osEvent event;
	uint8_t cardMounted = 0;

	int i;
	uint8_t message[255];

	while(1)
	{
		// ToDo: Taszk implementálása.
		i = 0;
		memset(message,0,255);

		// CD láb ellenõrzése
		event = osMessageGet(sdCardWrite_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			message[i] = (uint32_t)event.value.p;

			do
			{
				i++;

				event = osMessageGet(sdCardWrite_xMessage, 0);
				if(event.status == osEventMessage)
					message[i] = (uint32_t)event.value.p;
			} while(event.status == osEventMessage);

			if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_15) == GPIO_PIN_RESET)
			{
				if(!cardMounted)
				{
					if(f_mount(&fileSystem, SD_Path, 1) == FR_OK)
					{
						uint8_t path[12] = "logfile.txt";
						path[11] = '\0';

						cardMounted = 1;

						// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
						portENTER_CRITICAL();
						res = open_append(&logFile, path);

						if(res == FR_OK)
							res = f_write(&logFile, message, i, &testBytes);
						if(res == FR_OK)
							res = f_sync(&logFile);
						if(res == FR_OK)
							res = f_close(&logFile);
						portEXIT_CRITICAL();

						// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
						if(res != FR_OK)
						{
							f_mount(NULL, SD_Path, 1);
							// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
							disk.is_initialized[0] = 0;
							cardMounted = 0;
						}
						else
							HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
					}
				}
				else
				{
					uint8_t path[12] = "logfile.txt";
					path[11] = '\0';

					// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
					portENTER_CRITICAL();
					res = open_append(&logFile, path);

					if(res == FR_OK)
						res = f_write(&logFile, message, i, &testBytes);
					if(res == FR_OK)
						res = f_sync(&logFile);
					if(res == FR_OK)
						res = f_close(&logFile);
					portEXIT_CRITICAL();

					// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
					if(res != FR_OK)
					{
						f_mount(NULL, SD_Path, 1);
						// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
						disk.is_initialized[0] = 0;
						cardMounted = 0;
					}
					else
						HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
				}
			}
			else
			{
				if(cardMounted)
				{
					f_mount(NULL, SD_Path, 1);
					// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
					disk.is_initialized[0] = 0;
				}

				cardMounted = 0;
			}
		}
	}
}
#endif // defined(MEAS_W_LOAD)
/* USER CODE END 4 */

